Autodesk.Revit.DB.ConicalFace
A cone face of a 3d solid.
Remarks: Cone faces are defined by cone surfaces bounded by edge loops.
The surfaces provide natural UV parameterization to the faces.
S(u, v) = Origin + v*[sin(HalfAngle)*(cos(u)*Radius[0] + sin(u)*Radius[1]) + cos(HalfAngle)*Axis]